import { Question } from "../types/Question";

const personality: Question[] = [
  {
    id: 1,
    text: "자기소개 부탁드립니다.",
  },
  {
    id: 2,
    text: "왜 개발자가 되고 싶은가요? (전업했다면 그 이유)",
  },
  {
    id: 3,
    text: "개발자는 어떤 직업이라고 생각하나요?",
  },
  {
    id: 4,
    text: "본인이 생각하는 본인의 성격 장단점은 무엇인가요?",
  },
  {
    id: 5,
    text: "왜 굳이 프론트엔드를 선택했나요? 프론트엔드란 어떤 분야인가요?",
  },
  {
    id: 6,
    text: "개발자로서 중요하게 생각하는 점이 있다면 무엇인가요?",
  },
  {
    id: 7,
    text: "개발은 평생 공부해야 하는 분야인데 어떤 식으로 학습을 하고 있나요? 본인만의 학습법이 있다면?",
  },
  {
    id: 8,
    text: "개발자로서 목표가 무엇인가요? 혹은 본인의 인생의 목표가 무엇인가요?",
  },
  {
    id: 9,
    text: "최근 공부해보고 싶은 기술이 있다면 무엇이 있을까요?",
  },
  {
    id: 10,
    text: "스트레스 관리는 어떻게 하시나요?",
  },
  {
    id: 11,
    text: "프론트엔드는 기술이 빠르게 변화하는데 두려워하진 않나요?",
  },
  {
    id: 12,
    text: "프로젝트를 진행하면서 어려웠던 점과 어떻게 극복했는지 말해주세요.",
  },
  {
    id: 13,
    text: "저희 회사에 지원하신 이유 또는 동기가 뭔가요?",
  },
  {
    id: 14,
    text: "개발과 관련해서 기존의 생각을 뒤엎을만큼 강한 인상을 받았던 글이나 영상이 있으면 소개해주세요.",
  },
  {
    id: 15,
    text: "요즘은 어떤 공부를 하고 계신가요?",
  },
  {
    id: 16,
    text: "향후 커리어 적으로 목표가 있나요?",
  },
  {
    id: 17,
    text: "협업에서 기억에 가장 남는 상황에 대해 설명해주세요.",
  },
  {
    id: 18,
    text: "협업에서 어려웠던 경험이 있었나요?",
  },
  {
    id: 19,
    text: "자기 주장이 매우 강한 사람과 소통할 경우 어떻게 대응했었나요?",
  },
  {
    id: 20,
    text: "좋은 팀장의 기준은 뭘까요?",
  },
  {
    id: 21,
    text: "좋은 팀원의 기준은 뭘까요?",
  },
  {
    id: 22,
    text: "팀장 역할을 맡았을 때, 지원자님에게 비협조적이고 적대적인 팀원이 있다면 어떻게 대처하실건가요?",
  },
  {
    id: 23,
    text: "“팀에서 1인분을 한다”고 할 때, 1인분은 어떤걸 의미하는걸까요?",
  },
  {
    id: 24,
    text: "코드 리뷰로 인해 본인의 코드를 전부 고쳐야한다면 어떻게 할 것인가요?",
  },
  {
    id: 25,
    text: "훗날 현업에서 일하면서 기술적인 어려움 등으로 개발자가 된 것을 후회할 상황이 생긴다면 어떻게 할 것인가요?",
  },
  {
    id: 26,
    text: "최신 기술 트렌드는 어떻게 추적하시나요? 그렇게 찾은 최신 기술을 사용해보신 적이 있나요?",
  },
  {
    id: 27,
    text: "개발 기간을 촉박하게 요구하는 경우 어떻게 하시나요?",
  },
  {
    id: 28,
    text: "슬럼프가 올때 어떻게 대처 하시나요?",
  },
  {
    id: 29,
    text: "수행해야 하는 주제가 굉장히 어려운 주제라서, 나혼자서 해결 못할 일이 주어졌다고 가정해 볼게요. 어떻게 하실 건가요?",
  },
  {
    id: 30,
    text: "저희 회사에서 지원자를 뽑아야하는 이유가 있나요?",
  },
];

export default personality;
